tap "gptscript-ai/tap"
tap "homebrew/bundle"
brew "aria2"
brew "atuin"
brew "bat"
brew "btop"
brew "carapace"
brew "chezmoi"
brew "python@3.13"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gcc"
brew "gcc@11", link: false
brew "gh"
brew "glab"
brew "just"
brew "rg"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "neovim"
brew "pipx"
brew "podman-compose"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "trash-cli"
brew "ugrep"
brew "yq"
brew "zoxide"
brew "gptscript-ai/tap/clio"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nur.just-black"
vscode "orta.vscode-jest"
vscode "skellock.just"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
