tap "gptscript-ai/tap"
tap "homebrew/bundle"
# NOTE: verify that ublue-os/tap and bluefin-cli formula exist before running
tap "ublue-os/tap"

brew "aria2"
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "btop"
brew "carapace"
brew "chezmoi"
brew "colordiff"
brew "python@3.13"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gcc"
brew "gcc@11", link: false
brew "gdb"
brew "gemini-cli"
brew "gh"
brew "git-lfs"            # git large file storage
brew "bitwarden-cli"      # bw CLI for secret management
brew "glab"
brew "go"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "neovim"
brew "node"
brew "pipx"
brew "podman-compose"
brew "ramalama"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stress-ng"
brew "tealdeer"
brew "television"
brew "tmux"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "yq"
brew "zoxide"
brew "gptscript-ai/tap/clio"
# NOTE: verify ublue-os/tap/bluefin-cli exists before running brew bundle
brew "ublue-os/tap/bluefin-cli"

vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nur.just-black"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
